In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.22.4 in /home/sana/test/notebookenv/lib/python3.10/site-packages (from pandas) (2.1.0)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/sana/test/notebookenv/lib/python3.10/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /home/sana/test/notebookenv/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (13.0 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 13.0/13.0 MB 1.0 MB/s eta 0:00:00m eta 0:00:01[36m0:00:01m
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 505.5/505.5 kB 846.5 kB/s eta 0:00:00 eta 0:00:01[36m0:00:01m
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 345.4/345.4 kB 829.7 kB/s eta 0:00:0036m0:00:01m eta 0:00:01
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.2 pytz-2024.1 tzdata-2024.1

[notice] A new release of pip is available: 24.1 -> 24.2
[notice] To update, run: pip install --upgrade pip

In [2]:
import numpy as np
import pandas as pd

### Creating data frame

In [4]:
d = {'Name':['Mary', 'Tom', 'Ann'], 'Age':[22, 19, 30]}
df = pd.DataFrame(d)
print (df)
print (df.dtypes)

   Name  Age
0  Mary   22
1   Tom   19
2   Ann   30
Name    object
Age      int64
dtype: object

In [5]:
a = np.array([['Mary', 22], ['Tom', 19], ['Ann', 30]])
df2 = pd.DataFrame(a, columns=['Name','Age'])
print (df2)
print (df2.dtypes)

   Name Age
0  Mary  22
1   Tom  19
2   Ann  30
Name    object
Age     object
dtype: object

In [6]:
df3 = df2.astype({'Age':'int'})
df3.dtypes

Name    object
Age      int64
dtype: object

In [7]:
df3.index = ['A', 'B', 'C'] # Change the default index 
df3

   Name  Age
A  Mary   22
B   Tom   19
C   Ann   30

#### Access subset of data frame

In [19]:
df

   Name  Age
0  Mary   22
1   Tom   19
2   Ann   30

In [21]:
df['Age']

0    22
1    19
2    30
Name: Age, dtype: int64

In [9]:
df[['Name', 'Age']]

   Name  Age
0  Mary   22
1   Tom   19
2   Ann   30

In [10]:
df['Age'] > 20 # Return a Boolean series

0     True
1    False
2     True
Name: Age, dtype: bool

In [11]:
df[ df['Age'] > 20 ] # Return the rows which has 'Age' > 20

   Name  Age
0  Mary   22
2   Ann   30

In [12]:
df.loc[0] # Return the row with index 0

Name    Mary
Age       22
Name: 0, dtype: object

In [23]:
df.loc[1]

Name    Tom
Age      19
Name: 1, dtype: object

In [13]:
df.loc[0, 'Name'] # Return the element at row index 0 and column label 'Name'

'Mary'

In [24]:
df.loc[ df['Age'] > 20 ]

   Name  Age
0  Mary   22
2   Ann   30

In [25]:
df.loc[ df['Age'] > 20, 'Name'] # Return the names with age > 20

0    Mary
2     Ann
Name: Name, dtype: object

In [15]:
df.loc[:2, 'Name'] # Return rows 0 to 2-1 (slicing) and column label 'Name'

0    Mary
1     Tom
2     Ann
Name: Name, dtype: object

In [16]:
df.iloc[1] # Return rows with index 1

Name    Tom
Age      19
Name: 1, dtype: object

In [17]:
df.iloc[[1, 2]] # Return rows with index 1 & 2

  Name  Age
1  Tom   19
2  Ann   30

In [18]:
df.iloc[0, 1] # Return the element at row index 0 and column index 1

np.int64(22)

In [26]:
df.iloc[0:2, 0:1] # Return the rows before index 2 and 
                  # columns before index 1

   Name
0  Mary
1   Tom

In [27]:
df.iloc[1, 1] = 20
df.loc[0, 'Age'] = 23 # Modify a value
df.loc[ df.shape[0] ] = ['Bob', 17] # Add a new row
df

   Name  Age
0  Mary   23
1   Tom   20
2   Ann   30
3   Bob   17

### File IO

In [30]:
titanic_df = pd.read_csv("titanic.csv") # Read a DataFrame from titanic.csv
titanic_df # Show the DataFrame

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Descriptive Statistics

In [31]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [32]:
titanic_df['Age'].max() # Return the max of the Age column

np.float64(80.0)

In [33]:
titanic_df[ ['Age','Fare'] ].min() # Return max of the Age and Fare columns

Age     0.42
Fare    0.00
dtype: float64

In [34]:
titanic_df['Age'].mean() # Return the mean of the Age column

np.float64(29.69911764705882)

In [35]:
titanic_df['Age'].median() # Return the median of the Age column

np.float64(28.0)

#### Handling Missing Values

In [36]:
titanic_df['Age'].isna()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [37]:
titanic_df['Age'].fillna( 0 )

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [38]:
titanic_df['Age'].dropna()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 714, dtype: float64